#! /usr/bin/env python3.1
import db_search
import limitizer
suffixes = {
    1: ["ो", "े", "ू", "ु", "ी", "ि", "ा","त","क"],
    2: ["कर", "ाओ", "िए", "ाई", "ाए", "ने", "नी","नाे" "ते", "ीं", "ती", "ता", "ाँ", "ां", "ों", "ें","ओं"],
    3: ["ाकर", "ाइए", "ाईं", "ाया", "ेगी", "ेगा", "ोगी", "ोगे", "ाने", "ाना", "ाते", "ाती","ओं","ाता", "तीं", "ाओं", "ाएं", "ुओं", "ुएं", "ुआं"],
    4: ["ाएगी", "ाएगा", "ाओगी", "ाओगे", "एंगी", "ेंगी", "एंगे", "ेंगे", "ूंगी", "ूंगा", "ातीं", "नाओं", "नाएं", "ताओं", "ताएं", "ियाँ", "ियों", "ियां"],
    5: ["ाएंगी", "ाएंगे", "ाऊंगी", "ाऊंगा", "ाइयाँ", "ाइयों", "ाइयां","शाली"]
}
prefixes = {
    1: ["अ","ब","स","आ"],
    2: ["बा","ति","चौ","कु","कठ","अठ","गल","इक","सं","सम","सह","अन","अप","अव","सु","ला","वि","पर","उप","हथ","पन","दु","ना","नि","नौ","बच","बे","कर"],
    3: ["परा","सम्","मनो","महा","पंच","परि","षड्","स्व","बहु","उत्","अधि","अधो","अभि","सद्","अनु"],
    4: ["अंतर","आत्म","अंतः","दुस्","द्वि","द्वै","दुर्","दुष्","निर्","निष्","निस्","पुनः","ग़ैर","श्री"],
    5: ["पूर्व","प्रक्","प्रति","प्राय","आयुस्","पुनर्","बहिर्","अंतर्"],
    6: ["मंत्रि"]
}
def hi_stem(word):
    for L in 5, 4, 3, 2, 1:
        if len(word) > L + 1:
            for suf in suffixes[L]:
                if word.endswith(suf):
                    return (hi_stem1(word[:-L]))
    return hi_stem1(word)

def hi_stem1(word):
    for L in  6,5,4,3,2,1:
        if len(word) > L + 1:
            for pre in prefixes[L]:
                if word.startswith(pre):
                    return word[L:]
    return word
if __name__ == '__main__':
    import sys
    import  bisect
    print ("  Enter The Word in Hindi  /  हिंदी  में  शब्द  दर्ज  करे ")
    if len(sys.argv) != 1:
         sys.exit('{} takes no arguments'.format(sys.argv[0]))   
    for line in sys.stdin:
        for word in line.split():
            x = limitizer.search(word)
            if(x==1):
                continue
            else:
                db_search.search(word)